#Область СлужебныйПрограммныйИнтерфейс
	
Процедура ИсполняемыеСценарии() Экспорт
		
	ЮТТесты.ДобавитьТестовыйНабор("Документ Расход товара").ВТранзакции()
		.ДобавитьТест("СозданиеДокументов", "Создание документов")
		.ДобавитьТест("ПроведениеДокументов", "Проведения документов")
		.ДобавитьТест("ПроверкаОстатков", "Проверка остатков документов")
	;
		
КонецПроцедуры
	
Процедура СозданиеДокументов() Экспорт
	
	//// 1. Подготовка параметров и генерация данных для выполнения функции.
	ТаблицаТоваров    = ОМ_ДанныеДляГенерации.ТаблицаТоваров();
	РеквизитыДанных   = ОМ_ДанныеДляГенерации.РеквизитыДанных();

	Для Каждого Строка Из ТаблицаТоваров Цикл 
		
		ТоварНовый   	  = ОМ_ДанныеДляГенерации.СозданияТовара(Строка.Наименование);
		РасходТовара 	  = ОМ_ДанныеДляГенерации.СозданиеДокументаРасход(ТоварНовый, Строка, РеквизитыДанных); 

		// 2. Проверка утвержедия 
		ЮТест.ОжидаетЧтоТаблицаБазы("Документ.РасходТовара", "Документ не был создан")
    		.СодержитЗаписиСНомером(РасходТовара.Номер)
		;
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПроведениеДокументов() Экспорт
	
	//// 1. Подготовка параметров и генерация данных для выполнения функции.
	ТаблицаТоваров    = ОМ_ДанныеДляГенерации.ТаблицаТоваров();
	РеквизитыДанных   = ОМ_ДанныеДляГенерации.РеквизитыДанных();

	Для Каждого Строка Из ТаблицаТоваров Цикл 
		
		ТоварНовый    = ОМ_ДанныеДляГенерации.СозданияТовара(Строка.Наименование);
		ПриходТовара  = ОМ_ДанныеДляГенерации.ПроведениеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных); 
		РасходТовара  = ОМ_ДанныеДляГенерации.СозданиеДокументаРасход(ТоварНовый, Строка, РеквизитыДанных); 
	
		// 2. Проверка утвержедия
		
		//Проверка проведения 		
		ЮТест.ОжидаетЧто(РасходТовара.ПолучитьОбъект())  	    	
			.Метод("Записать",  ЮТМетоды.МассивПараметров(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный)) 
			.НеВыбрасываетИсключение()	
		;

		//Проверка что регистры содержат движения
		ОтборПоРегистратору = ЮТест.Предикат() 
	    	.Реквизит("Регистратор").Равно(РасходТовара)
			.Получить()
		; 
			
		//Проверка что регистры содержат движения 
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.Взаиморасчеты")
			.СодержитЗаписи(ОтборПоРегистратору)
		;
			
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.ТоварныеЗапасы")
			.СодержитЗаписи(ОтборПоРегистратору)
		;
		
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.Продажи")
			.СодержитЗаписи(ОтборПоРегистратору)
		;

		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПроверкаОстатков() Экспорт
	
	//// 1. Подготовка параметров и генерация данных для выполнения функции.
	ТаблицаТоваров    = ОМ_ДанныеДляГенерации.ТаблицаТоваров();
	РеквизитыДанных   = ОМ_ДанныеДляГенерации.РеквизитыДанных();

	Для Каждого Строка Из ТаблицаТоваров Цикл 
		
		ТоварНовый    = ОМ_ДанныеДляГенерации.СозданияТовара(Строка.Наименование);
		ПриходТовара  = ОМ_ДанныеДляГенерации.ПроведениеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных); 
		РасходТовара  = ОМ_ДанныеДляГенерации.СозданиеДокументаРасход(ТоварНовый, Строка, РеквизитыДанных); 
	
		// 2. Проверка утвержедия
		ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
		ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
		ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
		ОписаниеЗапроса.Условия.Добавить("Склад = &Склад");
		ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", ТоварНовый);
        ОписаниеЗапроса.ЗначенияПараметров.Вставить("Склад", РасходТовара.Склад);
		ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
		
		ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь(); 		
		
		ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
		ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
		ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
		ОписаниеЗапроса.Условия.Добавить("Валюта = &Валюта");
		ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", РасходТовара.Покупатель);
        ОписаниеЗапроса.ЗначенияПараметров.Вставить("Валюта", РасходТовара.Валюта);
		ОписаниеЗапроса.ВыбираемыеПоля.Добавить("СуммаОстаток");
		
		ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоЛожь(); 		

		
		
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти
	