#Область СлужебныйПрограммныйИнтерфейс
  
Функция РеквизитыДанных() Экспорт
	
	//Реквизиты для заполнения
	РеквизитыДанных = Новый Структура;
	РеквизитыДанных.Вставить("Склад", 		ЮТест.Данные().СоздатьЭлемент("Справочники.Склады"));
	РеквизитыДанных.Вставить("Валюта", 		ЮТест.Данные().СоздатьЭлемент("Справочники.Валюты"));
	РеквизитыДанных.Вставить("Организация", ЮТест.Данные().СоздатьЭлемент("Справочники.Организации"));
	РеквизитыДанных.Вставить("Контрагент",  ЮТест.Данные().СоздатьЭлемент("Справочники.Контрагенты"));
	
   	Возврат РеквизитыДанных;
	
КонецФункции

Функция ТаблицаТоваров() Экспорт
	
	// Заполняем из макета табличную часть	
	ТаблицаMarkDown = 
	"| Наименование	| Цена | Количество | Сумма |
	||--------------|------|------------|-------|
	|| Капуста      | 100  | 10         | 1000  |
	|| Морковка     | 50   | 15         | 750   |
	|| Картошка     | 40   | 30         | 1200  |";
	
	ОписанияТипов = Новый Соответствие;
	ОписанияТипов.Вставить("Наименование", 	 Новый ОписаниеТипов("Строка"));
	ОписанияТипов.Вставить("Цена",  	 	 Новый ОписаниеТипов("Число"));
	ОписанияТипов.Вставить("Количество", 	 Новый ОписаниеТипов("Число"));
	ОписанияТипов.Вставить("Сумма", 	 	 Новый ОписаниеТипов("Число"));
	
	ДанныеСтроки = ЮТест.Данные().ЗагрузитьИзМакета(ТаблицаMarkDown, ОписанияТипов);
	Возврат ДанныеСтроки;

КонецФункции 

Функция СозданияТовара(Наименование) Экспорт
	
	//Создание товара		
	КонструкторТовара = ЮТест.Данные().КонструкторОбъекта("Справочники.Товары")
		.ФикцияОбязательныхПолей()
		.Установить("Вид", Перечисления.ВидыТоваров.Товар)
		.Установить("Наименование", Наименование)
	;
    ТоварНовый = КонструкторТовара.Записать();
	
	Возврат ТоварНовый;

КонецФункции

Функция СозданиеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных) Экспорт

	// Создание прихода
	КонструкторПрихода = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса() - 100)
		.Установить("Склад", РеквизитыДанных.Склад)
		.Установить("Валюта", РеквизитыДанных.Валюта)
		.Установить("Организация", РеквизитыДанных.Организация)
		.Установить("Поставщик", РеквизитыДанных.Контрагент)
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", ТоварНовый)
			.Установить("Цена", Строка.Цена)
			.Установить("Количество", Строка.Количество)
			.Установить("Сумма", Строка.Сумма)
		; 
		
	ПриходТовара = КонструкторПрихода.Записать();
	
	Возврат ПриходТовара;

КонецФункции

Функция СозданиеДокументаРасход(ТоварНовый, Строка, РеквизитыДанных) Экспорт

	// Создание расхода
	КонструкторРасхода = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Склад", РеквизитыДанных.Склад)
		.Установить("Валюта", РеквизитыДанных.Валюта)
		.Установить("Организация", РеквизитыДанных.Организация)
		.Установить("Покупатель", РеквизитыДанных.Контрагент)
		.ФикцияРеквизитов("ВидЦен, ОбоснованиеОтгрузки")
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", ТоварНовый)
			.Установить("Цена", Строка.Цена)
			.Установить("Количество", Строка.Количество)
			.Установить("Сумма", Строка.Сумма)
		;
	РасходТовара = КонструкторРасхода.Записать();	
		
	Возврат РасходТовара;

КонецФункции

Функция ПроведениеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных) Экспорт

	// Создание прихода
	КонструкторПрихода = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса() - 100)
		.Установить("Склад", РеквизитыДанных.Склад)
		.Установить("Валюта", РеквизитыДанных.Валюта)
		.Установить("Организация", РеквизитыДанных.Организация)
		.Установить("Поставщик", РеквизитыДанных.Контрагент)
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", ТоварНовый)
			.Установить("Цена", Строка.Цена)
			.Установить("Количество", Строка.Количество)
			.Установить("Сумма", Строка.Сумма)
		; 
		
	ПриходТовара = КонструкторПрихода.Провести();
	
	Возврат ПриходТовара;

КонецФункции

Функция ПроведениеДокументаРасход(ТоварНовый, Строка, РеквизитыДанных) Экспорт

	// Создание расхода
	КонструкторРасхода = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")
		.ФикцияОбязательныхПолей()
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Склад", РеквизитыДанных.Склад)
		.Установить("Валюта", РеквизитыДанных.Валюта)
		.Установить("Организация", РеквизитыДанных.Организация)
		.Установить("Покупатель", РеквизитыДанных.Контрагент)
		.ФикцияРеквизитов("ВидЦен, ОбоснованиеОтгрузки")
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", ТоварНовый)
			.Установить("Цена", Строка.Цена)
			.Установить("Количество", Строка.Количество)
			.Установить("Сумма", Строка.Сумма)
		;
	РасходТовара = КонструкторРасхода.Провести();	
		
	Возврат РасходТовара;

КонецФункции

#КонецОбласти
  
