#Область СлужебныйПрограммныйИнтерфейс
	
Процедура ИсполняемыеСценарии() Экспорт
		
	ЮТТесты.ДобавитьТестовыйНабор("Документ Приход товара").ВТранзакции()
    	.ДобавитьТест("СозданиеДокументов", "Создание документов")
		.ДобавитьТест("ПроведениеДокументов", "Проведения документов")
	;
		
КонецПроцедуры
	
Процедура СозданиеДокументов() Экспорт
	
	//// 1. Подготовка параметров и генерация данных для выполнения функции.
	ТаблицаТоваров    = ОМ_ДанныеДляГенерации.ТаблицаТоваров();
	РеквизитыДанных   = ОМ_ДанныеДляГенерации.РеквизитыДанных();

	Для Каждого Строка Из ТаблицаТоваров Цикл 
		
		ТоварНовый   	  = ОМ_ДанныеДляГенерации.СозданияТовара(Строка.Наименование);
		ПриходТовара 	  = ОМ_ДанныеДляГенерации.СозданиеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных); 

		// 2. Проверка утвержедия 
		ЮТест.ОжидаетЧтоТаблицаБазы("Документ.ПриходТовара", "Документ не был создан")
    		.СодержитЗаписиСНомером(ПриходТовара.Номер)
		;
		
	КонецЦикла;
			
КонецПроцедуры

Процедура ПроведениеДокументов() Экспорт
	
	//// 1. Подготовка параметров и генерация данных для выполнения функции.
	ТаблицаТоваров    = ОМ_ДанныеДляГенерации.ТаблицаТоваров();
	РеквизитыДанных   = ОМ_ДанныеДляГенерации.РеквизитыДанных();

	Для Каждого Строка Из ТаблицаТоваров Цикл 
		
		ТоварНовый   	  = ОМ_ДанныеДляГенерации.СозданияТовара(Строка.Наименование);
		ПриходТовара 	  = ОМ_ДанныеДляГенерации.СозданиеДокументаПриход(ТоварНовый, Строка, РеквизитыДанных); 
		
		// 2. Проверка утвержедия
		
		//Проверка проведения
		ЮТест.ОжидаетЧто(ПриходТовара.ПолучитьОбъект())  
			.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
			.НеВыбрасываетИсключение()	
		;
		
		//Проверка что регистры содержат движения
		ОтборПоРегистратору = ЮТест.Предикат() 
        	.Реквизит("Регистратор").Равно(ПриходТовара)
			.Получить()
		; 
			
		//Проверка что регистры движения 
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.Взаиморасчеты")
    		.СодержитЗаписи(ОтборПоРегистратору)
		;
			
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрНакопления.ТоварныеЗапасы")
    		.СодержитЗаписи(ОтборПоРегистратору)
		;
	
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти
